Revit 2026 API

# BuiltInFailuresDesignOptionFailuresDebugLevelsInOptionsWarn Property

---

This is an internal diagnostic message.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FailureDefinitionId DebugLevelsInOptionsWarn { get; }
```
```vb
Public Shared ReadOnly Property DebugLevelsInOptionsWarn As FailureDefinitionId
	Get
```
```cpp
public:
static property FailureDefinitionId^ DebugLevelsInOptionsWarn {
	FailureDefinitionId^ get ();
}
```
```fsharp
static member DebugLevelsInOptionsWarn : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId

#### Reference

BuiltInFailuresDesignOptionFailures Class

Autodesk.Revit.DB Namespace